//************************************************************************
// SakuLuaの呼び出し実行モジュール
//************************************************************************
#if defined __cplusplus
extern "C" {
#endif

#include "lua/lua.h"
#include "lua/lualib.h"
#include "lua/lauxlib.h"

#if defined __cplusplus
}
#endif

//**************************************************
//  Lua言語を実行します
//**************************************************
bool LuaRun( void );

//**************************************************
//  エラーメッセージ
//**************************************************
void LuaErrorMes( lua_State *LuaLinkP, char* mes, int type );
