//************************************************************************
// シリアル通信関連
//************************************************************************

//**************************************************
// XBee通信初期化: Serial.XBee
//  Serial.XBee([baudrate])
//	baudrate: ボーレート
//  stdin: 標準
//   省略時は9600bpsです
//**************************************************
int serialXBee( lua_State *LuaLinkP );

//**************************************************
// USB通信初期化: Serial.USB
//  Serial.USB([baudrate])
//	baudrate: ボーレート
//   省略時は9600bpsです
//**************************************************
int serialUSB( lua_State *LuaLinkP );

//**************************************************
// 標準出力に対応させます: Serial.setDef
//  Serial.setDef()
//**************************************************
int serialSetDefault( lua_State *LuaLinkP );

//**************************************************
// シリアルに出力します: Serial.print
//  Serial.print([str])
//  str: 文字列
//    省略時は何も出力しません
//**************************************************
int serialPrint( lua_State *LuaLinkP );

//**************************************************
// シリアルに\r\n付きで出力します: Serial.println
//  Serial.println([str])
//  str: 文字列
//    省略時は何も出力しません
//**************************************************
int serialPrintln( lua_State *LuaLinkP );
